light-136/GitCC/GD32驱动器/GD32固件烧录/GD32 All In One Programmer/OptionBytesXML/GD32A71x.xml
                    <description>OB_USER1 complement value bit 39 to 32</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1[47:40]</name>
            <displayName>OB_USER1[47:40]</displayName>
            <addressOffset>0x22</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_USER1[47:40]</name>
                    <brief>OB_USER1 value bit 47 to 40</brief>
                    <description>OB_USER1 value bit 47 to 40</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1_N[47:40]</name>
            <displayName>OB_USER1_N[47:40]</displayName>
            <addressOffset>0x23</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_USER1_N[47:40]</name>
                    <brief>OB_USER1 complement value bit 47 to 40</brief>
                    <description>OB_USER1 complement value bit 47 to 40</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1[55:48]</name>
            <displayName>OB_USER1[55:48]</displayName>
            <addressOffset>0x24</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_USER1[55:48]</name>
                    <brief>OB_USER1 value bit 55 to 48</brief>
                    <description>OB_USER1 value bit 55 to 48</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1_N[55:48]</name>
            <displayName>OB_USER1_N[55:48]</displayName>
            <addressOffset>0x25</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_USER1_N[55:48]</name>
                    <brief>OB_USER1 complement value bit 55 to 48</brief>
                    <description>OB_USER1 complement value bit 55 to 48</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1[63:56]</name>
            <displayName>OB_USER1[63:56]</displayName>
            <addressOffset>0x26</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_USER1[63:56]</name>
                    <brief>OB_USER1 value bit 63 to 56</brief>
                    <description>OB_USER1 value bit 63 to 56</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1_N[63:56]</name>
            <displayName>OB_USER1_N[63:56]</displayName>
            <addressOffset>0x27</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_USER1_N[63:56]</name>
                    <brief>OB_USER1 complement value bit 63 to 56</brief>
                    <description>OB_USER1 complement value bit 63 to 56</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_DFWP[7:0]</name>
            <displayName>OB_DFWP[7:0]</displayName>
            <addressOffset>0x28</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_DFWP[7]</name>
                    <brief>0x881C000~0x881FFFF</brief>
                    <description>Page erase / program protection of Data flash bit 7(0x881C000~0x881FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_DFWP[6]</name>
                    <brief>0x8818000~0x881BFFF</brief>
                    <description>Page erase / program protection of Data flash bit 6(0x8818000~0x881BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_DFWP[5]</name>
                    <brief>0x8814000~0x8817FFF</brief>
                    <description>Page erase / program protection of Data flash bit 5(0x8814000~0x8817FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_DFWP[4]</name>
                    <brief>0x8810000~0x8813FFF</brief>
                    <description>Page erase / program protection of Data flash bit 4(0x8810000~0x8813FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_DFWP[3]</name>
                    <brief>0x880C000~0x880FFFF</brief>
                    <description>Page erase / program protection of Data flash bit 3(0x880C000~0x880FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_DFWP[2]</name>
                    <brief>0x8808000~0x880BFFF</brief>
                    <description>Page erase / program protection of Data flash bit 2(0x8808000~0x880BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_DFWP[1]</name>
                    <brief>0x8804000~0x8807FFF</brief>
                    <description>Page erase / program protection of Data flash bit 1(0x8804000~0x8807FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_DFWP[0]</name>
                    <brief>0x8800000~0x8803FFF</brief>
                    <description>Page erase / program protection of Data flash bit 0(0x8800000~0x8803FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_DFWP_N[7:0]</name>
            <displayName>OB_DFWP_N[7:0]</displayName>
            <addressOffset>0x29</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_DFWP_N[7:0]</name>
                    <brief>OB_DFWP complement value bit 7 to 0</brief>
                    <description>OB_DFWP complement value bit 7 to 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_CLTCFG[7:0]</name>
            <displayName>OB_CLTCFG[7:0]</displayName>
            <addressOffset>0x2A</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFD</reset>
            <complement>FFFF</complement>
            <fields>
				<field>
                    <name>PORWDG_EN</name>
                    <brief>POR watchdog enable</brief>
					<description>POR watchdog enable&#x000A;0:POR watchdog disabled&#x000A;1:POR watchdog enabled</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
				<field>
                    <name>FFPIN_MOD</name>
                    <brief>configuration of the fatal fault pins mode</brief>
					<description>configuration of the fatal fault pins mode&#x000A;0:FFPin[0] and FFPin[1] acts as general GPIO pins&#x000A;1:FFPin[0] and FFPin[1] acts as dedicated fatal fault reaction pins</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
				<field>
                    <name>RSTPIN_MOD</name>
                    <brief>Reset pin mode</brief>
					<description>Reset pin mode&#x000A;0:Reset pin acts as general GPIO pin multiplexed with non-reset function&#x000A;1:Reset pin acts as dedicated</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_CLTCFG_N[7:0]</name>
            <displayName>OB_CLTCFG_N[7:0]</displayName>
            <addressOffset>0x2B</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x02</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_CLTCFG_N[7:0]</name>
                    <brief>OB_CLTCFG complement value bit 7 to 0</brief>
                    <description>OB_CLTCFG complement value bit 7 to 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_CLTCFG[15:8]</name>
            <displayName>OB_CLTCFG[15:8]</displayName>
            <addressOffset>0x2C</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0x00</reset>
            <complement>FFFF</complement>
            <fields>
				<field>
                    <name>RCTL_SUBSRU_UEN</name>
                    <brief>Subsystem reset upgrade upgrade enable</brief>
					<description>Subsystem reset upgrade upgrade enable&#x000A;0:RCTL_SUBSRU upgrade disable&#x000A;1:RCTL_SUBSRU system reset upgrade enable</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
				<field>
                    <name>STCM_REC_FAIL_UEN</name>
                    <brief>STCM recover failed upgrade enable</brief>
					<description>STCM recover failed upgrade enable&#x000A;0:STCM_REC_FAIL system reset upgrade disable&#x000A;1:STCM_REC_FAIL system reset upgrade enable</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
				<field>
                    <name>FMU_REA_FAIL_UEN</name>
                    <brief>FMU react failed upgrade enable</brief>
					<description>FMU react failed upgrade enable&#x000A;0:FMU_REA_FAIL system reset upgrade disable&#x000A;1:FMU_REA_FAIL system reset upgrade enable</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_CLTCFG_N[15:8]</name>
            <displayName>OB_CLTCFG_N[15:8]</displayName>
            <addressOffset>0x2D</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0xFF</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_CLTCFG_N[15:8]</name>
                    <brief>OB_CLTCFG complement value bit 15 to 8</brief>
                    <description>OB_CLTCFG complement value bit 15 to 8</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_CLTCFG[23:16]</name>
            <displayName>OB_CLTCFG[23:16]</displayName>
            <addressOffset>0x2E</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0x00</reset>
            <complement>FFFF</complement>
            <fields>
				<field>
                    <name>SYS_CK_FAIL_UEN</name>
                    <brief>System clock failed upgrade enable</brief>
					<description>System clock failed upgrade enable&#x000A;0:SYS_CK_FAIL system reset upgrade disable&#x000A;1:SYS_CK_FAIL system reset upgrade enable</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>		
				<field>
                    <name>CORE_CK_FAIL_UEN</name>
                    <brief>Core clock failed upgrade enable</brief>
					<description>Core clock failed upgrade enable&#x000A;0:CORE_CK_FAIL system reset upgrade disable&#x000A;1:CORE_CK_FAIL system reset upgrade enable</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>				
				<field>
                    <name>LOPRST_UEN</name>
                    <brief>Loss of PLL error upgrade enable</brief>
					<description>Loss of PLL error upgrade enable&#x000A;0:LOPRST system reset upgrade disable&#x000A;1:LOPRST system reset upgrade enable</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
				<field>
                    <name>LOHRST_UEN</name>
                    <brief>Loss of HXTAL error upgrade enable</brief>
					<description>Loss of HXTAL error upgrade enable&#x000A;0:LOHRST system reset upgrade disable&#x000A;1:LOHRST system reset upgrade enable</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_CLTCFG_N[23:16]</name>
            <displayName>OB_CLTCFG_N[23:16]</displayName>
            <addressOffset>0x2F</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0xFF</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_CLTCFG_N[23:16]</name>
                    <brief>OB_CLTCFG complement value bit 23 to 16</brief>
                    <description>OB_CLTCFG complement value bit 23 to 16</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_CLTCFG[31:24]</name>
            <displayName>OB_CLTCFG[31:24]</displayName>
            <addressOffset>0x30</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0x00</reset>
            <complement>FFFF</complement>
            <fields>
				<field>
                    <name>HSM_SYS_RST_UEN</name>
                    <brief>HSM system reset detection upgrade enable</brief>
					<description>HSM system reset detection upgrade enable&#x000A;0:HSM_SYS_RST system reset upgrade disable&#x000A;1:HSM_SYS_RST system reset upgrade enable</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_CLTCFG_N[31:24]</name>
            <displayName>OB_CLTCFG_N[31:24]</displayName>
            <addressOffset>0x31</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0xFF</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_CLTCFG_N[31:24]</name>
                    <brief>OB_CLTCFG complement value bit 31 to 24</brief>
                    <description>OB_CLTCFG complement value bit 31 to 24</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_CLTCFG[39:32]</name>
            <displayName>OB_CLTCFG[39:32]</displayName>
            <addressOffset>0x32</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0x00</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>DBG_SYS_RST_UEN</name>
                    <brief>Debug system reset upgrade enable</brief>
					<description>Debug system reset upgrade enable&#x000A;0:DBG_SYS_RST system reset upgrade disable&#x000A;1:DBG_SYS_RST system reset upgrade enable</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
				<field>
                    <name>SW_SYS_RST_UEN</name>
                    <brief>Software system reset upgrade enable</brief>
					<description>Software system reset upgrade enable&#x000A;0:SW_SYS_RST system reset upgrade disable&#x000A;1:SW_SYS_RST system reset upgrade enable</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_CLTCFG_N[39:32]</name>
            <displayName>OB_CLTCFG_N[39:32]</displayName>
            <addressOffset>0x33</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0xFF</reset>
            <complement>0</complement>
            <fields>
				<field>
                    <name>OB_CLTCFG_N[39:32]</name>
                    <brief>OB_CLTCFG complement value bit 39 to 32</brief>
                    <description>OB_CLTCFG complement value bit 39 to 32</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
		<OPByte>
            <name>OB_CLTCFG[47:40]</name>
            <displayName>OB_CLTCFG[47:40]</displayName>
            <addressOffset>0x34</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0x00</reset>
            <complement>FFFF</complement>
            <fields>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_CLTCFG_N[47:40]</name>
            <displayName>OB_CLTCFG_N[47:40]</displayName>
            <addressOffset>0x35</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0xFF</reset>
            <complement>0</complement>
            <fields>
				<field>
                    <name>OB_CLTCFG_N[47:40]</name>
                    <brief>OB_CLTCFG complement value bit 47 to 40</brief>
                    <description>OB_CLTCFG complement value bit 47 to 40</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
    </OPBytes>
</OPBytesArchitecture>
<OPBytesArchitecture type = "1">
	<OPBytes baseAddress="0x1FFF8800" length="52" RegType="OptionBytes">
        <OPByte>
            <name>OB_SPC</name>
            <displayName>OB_SPC</displayName>
            <addressOffset>0x0</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xA5</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_SPC</name>
                    <brief>HOST option bytes security protection value</brief>
                    <description>HOST option bytes security protection value&#x000A;0xA5 : no security protection&#x000A;any value except 0xA5 or 0xCC : protection level low&#x000A;0xCC : protection level high</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_SPC_N</name>
            <displayName>OB_SPC_N</displayName>
            <addressOffset>0x1</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x5A</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_SPC_N</name>
                    <brief>OB_SPC complement value</brief>
                    <description>OB_SPC complement value</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER</name>
            <displayName>OB_USER</displayName>
            <addressOffset>0x2</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>nFWDG_STDBY</name>
                    <brief>nFWDG_STDBY</brief>
                    <description>nFWDG_STDBY&#x000A;0: free watchdog stops counting in standby mode&#x000A;1: free watchdog continues counting in standby mode</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>nRST_STDBY</name>
                    <brief>nRST_STDBY</brief>
                    <description>nRST_STDBY&#x000A;0: generate a reset instead of entering standby mode&#x000A;1: no reset when entering standby mode</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>nFWDG0_HW</name>
                    <brief>nFWDG0_HW</brief>
                    <description>nFWDG0_HW&#x000A;0: hardware free watchdog 0&#x000A;1: software free watchdog 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER_N</name>
            <displayName>OB_USER_N</displayName>
            <addressOffset>0x3</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_USER_N</name>
                    <brief>OB_USER complement value</brief>
