light-136/GitCC/GD32驱动器/GD32固件烧录/GD32 All In One Programmer/OptionBytesXML/GD32A71x.xml
                    <description>OB_USER complement value</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_DATA[7:0]</name>
            <displayName>OB_DATA[7:0]</displayName>
            <addressOffset>0x4</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_DATA[7:0]</name>
                    <brief>user defined data bit 7 to 0</brief>
                    <description>user defined data bit 7 to 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_DATA_N[7:0]</name>
            <displayName>OB_DATA_N[7:0]</displayName>
            <addressOffset>0x5</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_DATA_N[7:0]</name>
                    <brief>OB_DATA complement value bit 7 to 0</brief>
                    <description>OB_DATA complement value bit 7 to 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_DATA[15:8]</name>
            <displayName>OB_DATA[15:8]</displayName>
            <addressOffset>0x6</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_DATA[15:8]</name>
                    <brief>user defined data bit 15 to 8</brief>
                    <description>user defined data bit 15 to 8</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_DATA_N[15:8]</name>
            <displayName>OB_DATA_N[15:8]</displayName>
            <addressOffset>0x7</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_DATA_N[15:8]</name>
                    <brief>OB_DATA complement value bit 15 to 8</brief>
                    <description>OB_DATA complement value bit 15 to 8</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP[7:0]</name>
            <displayName>OB_BK0WP[7:0]</displayName>
            <addressOffset>0x8</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK0WP[7]</name>
                    <brief>0x801C000~0x801FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 7(0x801C000~0x801FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[6]</name>
                    <brief>0x8018000~0x801BFFF</brief>
                    <description>Page erase / program protection of bank0 bit 6(0x8018000~0x801BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[5]</name>
                    <brief>0x8014000~0x8017FFF</brief>
                    <description>Page erase / program protection of bank0 bit 5(0x8014000~0x8017FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[4]</name>
                    <brief>0x8010000~0x8013FFF</brief>
                    <description>Page erase / program protection of bank0 bit 4(0x8010000~0x8013FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[3]</name>
                    <brief>0x800C000~0x800FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 3(0x800C000~0x800FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[2]</name>
                    <brief>0x8008000~0x800BFFF</brief>
                    <description>Page erase / program protection of bank0 bit 2(0x8008000~0x800BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[1]</name>
                    <brief>0x8004000~0x8007FFF</brief>
                    <description>Page erase / program protection of bank0 bit 1(0x8004000~0x8007FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[0]</name>
                    <brief>0x8000000~0x8003FFF</brief>
                    <description>Page erase / program protection of bank0 bit 0(0x8000000~0x8003FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP_N[7:0]</name>
            <displayName>OB_BK0WP_N[7:0]</displayName>
            <addressOffset>0x9</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_BK0WP_N[7:0]</name>
                    <brief>OB_BK0WP complement value bit 7 to 0</brief>
                    <description>OB_BK0WP complement value bit 7 to 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP[15:8]</name>
            <displayName>OB_BK0WP[15:8]</displayName>
            <addressOffset>0xA</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK0WP[15]</name>
                    <brief>0x803C000~0x803FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 15(0x803C000~0x803FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[14]</name>
                    <brief>0x8038000~0x803BFFF</brief>
                    <description>Page erase / program protection of bank0 bit 14(0x8038000~0x803BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[13]</name>
                    <brief>0x8034000~0x8037FFF</brief>
                    <description>Page erase / program protection of bank0 bit 13(0x8034000~0x8037FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[12]</name>
                    <brief>0x8030000~0x8033FFF</brief>
                    <description>Page erase / program protection of bank0 bit 12(0x8030000~0x8033FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[11]</name>
                    <brief>0x802C000~0x802FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 11(0x802C000~0x802FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[10]</name>
                    <brief>0x8028000~0x802BFFF</brief>
                    <description>Page erase / program protection of bank0 bit 10(0x8028000~0x802BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[9]</name>
                    <brief>0x8024000~0x8027FFF</brief>
                    <description>Page erase / program protection of bank0 bit 9(0x8024000~0x8027FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[8]</name>
                    <brief>0x8020000~0x8023FFF</brief>
                    <description>Page erase / program protection of bank0 bit 8(0x8020000~0x8023FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP_N[15:8]</name>
            <displayName>OB_BK0WP_N[15:8]</displayName>
            <addressOffset>0xB</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_BK0WP_N[15:8]</name>
                    <brief>OB_BK0WP complement value bit 15 to 8</brief>
                    <description>OB_BK0WP complement value bit 15 to 8</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP[23:16]</name>
            <displayName>OB_BK0WP[23:16]</displayName>
            <addressOffset>0xC</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK0WP[23]</name>
                    <brief>0x805C000~0x805FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 23(0x805C000~0x805FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[22]</name>
                    <brief>0x8058000~0x805BFFF</brief>
                    <description>Page erase / program protection of bank0 bit 22(0x8058000~0x805BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[21]</name>
                    <brief>0x8054000~0x8057FFF</brief>
                    <description>Page erase / program protection of bank0 bit 21(0x8054000~0x8057FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[20]</name>
                    <brief>0x8050000~0x8053FFF</brief>
                    <description>Page erase / program protection of bank0 bit 20(0x8050000~0x8053FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[19]</name>
                    <brief>0x804C000~0x804FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 19(0x804C000~0x804FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[18]</name>
                    <brief>0x8048000~0x804BFFF</brief>
                    <description>Page erase / program protection of bank0 bit 18(0x8048000~0x804BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[17]</name>
                    <brief>0x8044000~0x8047FFF</brief>
                    <description>Page erase / program protection of bank0 bit 17(0x8044000~0x8047FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[16]</name>
                    <brief>0x8040000~0x8043FFF</brief>
                    <description>Page erase / program protection of bank0 bit 16(0x8040000~0x8043FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP_N[23:16]</name>
            <displayName>OB_BK0WP_N[23:16]</displayName>
            <addressOffset>0xD</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_BK0WP_N[23:16]</name>
                    <brief>OB_BK0WP complement value bit 23 to 16</brief>
                    <description>OB_BK0WP complement value bit 23 to 16</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP[31:24]</name>
            <displayName>OB_BK0WP[31:24]</displayName>
            <addressOffset>0xE</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK0WP[31]</name>
                    <brief>0x807C000~0x807FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 31(0x807C000~0x807FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[30]</name>
                    <brief>0x8078000~0x807BFFF</brief>
                    <description>Page erase / program protection of bank0 bit 30(0x8078000~0x807BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[29]</name>
                    <brief>0x8074000~0x8077FFF</brief>
                    <description>Page erase / program protection of bank0 bit 29(0x8074000~0x8077FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[28]</name>
                    <brief>0x8070000~0x8073FFF</brief>
                    <description>Page erase / program protection of bank0 bit 28(0x8070000~0x8073FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[27]</name>
                    <brief>0x806C000~0x806FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 27(0x806C000~0x806FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[26]</name>
                    <brief>0x8068000~0x806BFFF</brief>
                    <description>Page erase / program protection of bank0 bit 26(0x8068000~0x806BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[25]</name>
                    <brief>0x8064000~0x8067FFF</brief>
                    <description>Page erase / program protection of bank0 bit 25(0x8064000~0x8067FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[24]</name>
                    <brief>0x8060000~0x8063FFF</brief>
                    <description>Page erase / program protection of bank0 bit 24(0x8060000~0x8063FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP_N[31:24]</name>
            <displayName>OB_BK0WP_N[31:24]</displayName>
            <addressOffset>0xF</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_BK0WP_N[31:24]</name>
                    <brief>OB_BK0WP complement value bit 31 to 24</brief>
                    <description>OB_BK0WP complement value bit 31 to 24</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK1WP[7:0]</name>
            <displayName>OB_BK1WP[7:0]</displayName>
            <addressOffset>0x10</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK1WP[7]</name>
                    <brief>0x809C000~0x809FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 7(0x809C000~0x809FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[6]</name>
                    <brief>0x8098000~0x809BFFF</brief>
                    <description>Page erase / program protection of bank1 bit 6(0x8098000~0x809BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[5]</name>
                    <brief>0x8094000~0x8097FFF</brief>
                    <description>Page erase / program protection of bank1 bit 5(0x8094000~0x8097FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[4]</name>
                    <brief>0x8090000~0x8093FFF</brief>
                    <description>Page erase / program protection of bank1 bit 4(0x8090000~0x8093FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[3]</name>
                    <brief>0x808C000~0x808FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 3(0x808C000~0x808FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[2]</name>
                    <brief>0x8088000~0x808BFFF</brief>
                    <description>Page erase / program protection of bank1 bit 2(0x8088000~0x808BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[1]</name>
                    <brief>0x8084000~0x8087FFF</brief>
                    <description>Page erase / program protection of bank1 bit 1(0x8084000~0x8087FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[0]</name>
                    <brief>0x8080000~0x8083FFF</brief>
                    <description>Page erase / program protection of bank1 bit 0(0x8080000~0x8083FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK1WP_N[7:0]</name>
            <displayName>OB_BK1WP_N[7:0]</displayName>
            <addressOffset>0x11</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
