light-136/GitCC/GD32驱动器/GD32固件烧录/GD32 All In One Programmer/OptionBytesXML/GD32A71x.xml
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_BK1WP_N[7:0]</name>
                    <brief>OB_BK1WP complement value bit 7 to 0</brief>
                    <description>OB_BK1WP complement value bit 7 to 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK1WP[15:8]</name>
            <displayName>OB_BK1WP[15:8]</displayName>
            <addressOffset>0x12</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK1WP[15]</name>
                    <brief>0x80BC000~0x80BFFFF</brief>
                    <description>Page erase / program protection of bank1 bit 15(0x80BC000~0x80BFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[14]</name>
                    <brief>0x80B8000~0x80BBFFF</brief>
                    <description>Page erase / program protection of bank1 bit 14(0x80B8000~0x80BBFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[13]</name>
                    <brief>0x80B4000~0x80B7FFF</brief>
                    <description>Page erase / program protection of bank1 bit 13(0x80B4000~0x80B7FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[12]</name>
                    <brief>0x80B0000~0x80B3FFF</brief>
                    <description>Page erase / program protection of bank1 bit 12(0x80B0000~0x80B3FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[11]</name>
                    <brief>0x80AC000~0x80AFFFF</brief>
                    <description>Page erase / program protection of bank1 bit 11(0x80AC000~0x80AFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[10]</name>
                    <brief>0x80A8000~0x80ABFFF</brief>
                    <description>Page erase / program protection of bank1 bit 10(0x80A8000~0x80ABFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[9]</name>
                    <brief>0x80A4000~0x80A7FFF</brief>
                    <description>Page erase / program protection of bank1 bit 9(0x80A4000~0x80A7FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[8]</name>
                    <brief>0x80A0000~0x80A3FFF</brief>
                    <description>Page erase / program protection of bank1 bit 8(0x80A0000~0x80A3FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK1WP_N[15:8]</name>
            <displayName>OB_BK1WP_N[15:8]</displayName>
            <addressOffset>0x13</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_BK1WP_N[15:8]</name>
                    <brief>OB_BK1WP complement value bit 15 to 8</brief>
                    <description>OB_BK1WP complement value bit 15 to 8</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK1WP[23:16]</name>
            <displayName>OB_BK1WP[23:16]</displayName>
            <addressOffset>0x14</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK1WP[23]</name>
                    <brief>0x80DC000~0x80DFFFF</brief>
                    <description>Page erase / program protection of bank1 bit 23(0x80DC000~0x80DFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[22]</name>
                    <brief>0x80D8000~0x80DBFFF</brief>
                    <description>Page erase / program protection of bank1 bit 22(0x80D8000~0x80DBFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[21]</name>
                    <brief>0x80D4000~0x80D7FFF</brief>
                    <description>Page erase / program protection of bank1 bit 21(0x80D4000~0x80D7FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[20]</name>
                    <brief>0x80D0000~0x80D3FFF</brief>
                    <description>Page erase / program protection of bank1 bit 20(0x80D0000~0x80D3FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[19]</name>
                    <brief>0x80CC000~0x80CFFFF</brief>
                    <description>Page erase / program protection of bank1 bit 19(0x80CC000~0x80CFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[18]</name>
                    <brief>0x80C8000~0x80CBFFF</brief>
                    <description>Page erase / program protection of bank1 bit 18(0x80C8000~0x80CBFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[17]</name>
                    <brief>0x80C4000~0x80C7FFF</brief>
                    <description>Page erase / program protection of bank1 bit 17(0x80C4000~0x80C7FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[16]</name>
                    <brief>0x80C0000~0x80C3FFF</brief>
                    <description>Page erase / program protection of bank1 bit 16(0x80C0000~0x80C3FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK1WP_N[23:16]</name>
            <displayName>OB_BK1WP_N[23:16]</displayName>
            <addressOffset>0x15</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_BK1WP_N[23:16]</name>
                    <brief>OB_BK1WP complement value bit 23 to 16</brief>
                    <description>OB_BK1WP complement value bit 23 to 16</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK1WP[31:24]</name>
            <displayName>OB_BK1WP[31:24]</displayName>
            <addressOffset>0x16</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK1WP[31]</name>
                    <brief>0x80FC000~0x80FFFFF</brief>
                    <description>Page erase / program protection of bank1 bit 31(0x80FC000~0x80FFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[30]</name>
                    <brief>0x80F8000~0x80FBFFF</brief>
                    <description>Page erase / program protection of bank1 bit 30(0x80F8000~0x80FBFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[29]</name>
                    <brief>0x80F4000~0x80F7FFF</brief>
                    <description>Page erase / program protection of bank1 bit 29(0x80F4000~0x80F7FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[28]</name>
                    <brief>0x80F0000~0x80F3FFF</brief>
                    <description>Page erase / program protection of bank1 bit 28(0x80F0000~0x80F3FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[27]</name>
                    <brief>0x80EC000~0x80EFFFF</brief>
                    <description>Page erase / program protection of bank1 bit 27(0x80EC000~0x80EFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[26]</name>
                    <brief>0x80E8000~0x80EBFFF</brief>
                    <description>Page erase / program protection of bank1 bit 26(0x80E8000~0x80EBFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[25]</name>
                    <brief>0x80E4000~0x80E7FFF</brief>
                    <description>Page erase / program protection of bank1 bit 25(0x80E4000~0x80E7FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[24]</name>
                    <brief>0x80E0000~0x80E3FFF</brief>
                    <description>Page erase / program protection of bank1 bit 24(0x80E0000~0x80E3FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK1WP_N[31:24]</name>
            <displayName>OB_BK1WP_N[31:24]</displayName>
            <addressOffset>0x17</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_BK1WP_N[31:24]</name>
                    <brief>OB_BK1WP complement value bit 31 to 24</brief>
                    <description>OB_BK1WP complement value bit 31 to 24</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1[7:0]</name>
            <displayName>OB_USER1[7:0]</displayName>
            <addressOffset>0x18</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>value bit 7 to 0</name>
                    <brief>value bit 7 to 0</brief>
                    <description>value bit 7 to 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1_N[7:0]</name>
            <displayName>OB_USER1_N[7:0]</displayName>
            <addressOffset>0x19</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_USER1_N[7:0]</name>
                    <brief>OB_USER1 complement value bit 7 to 0</brief>
                    <description>OB_USER1 complement value bit 7 to 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1[15:8]</name>
            <displayName>OB_USER1[15:8]</displayName>
            <addressOffset>0x1A</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_USER1[15:8]</name>
                    <brief>OB_USER1 value bit 15 to 8</brief>
                    <description>OB_USER1 value bit 15 to 8</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1_N[15:8]</name>
            <displayName>OB_USER1_N[15:8]</displayName>
            <addressOffset>0x1B</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_USER1_N[15:8]</name>
                    <brief>OB_USER1 complement value bit 15 to 8</brief>
                    <description>OB_USER1 complement value bit 15 to 8</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1[23:16]</name>
            <displayName>OB_USER1[23:16]</displayName>
            <addressOffset>0x1C</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_USER1[23:16]</name>
                    <brief>OB_USER1 value bit 23 to 16</brief>
                    <description>OB_USER1 value bit 23 to 16</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1_N[23:16]</name>
            <displayName>OB_USER1_N[23:16]</displayName>
            <addressOffset>0x1D</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_USER1_N[23:16]</name>
                    <brief>OB_USER1 complement value bit 23 to 16</brief>
                    <description>OB_USER1 complement value bit 23 to 16</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1[31:24]</name>
            <displayName>OB_USER1[31:24]</displayName>
            <addressOffset>0x1E</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_USER1[31:24]</name>
                    <brief>OB_USER1 value bit 31 to 24</brief>
                    <description>OB_USER1 value bit 31 to 24</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1_N[31:24]</name>
            <displayName>OB_USER1_N[31:24]</displayName>
            <addressOffset>0x1F</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_USER1_N[31:24]</name>
                    <brief>OB_USER1 complement value bit 31 to 24</brief>
                    <description>OB_USER1 complement value bit 31 to 24</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1[39:32]</name>
            <displayName>OB_USER1[39:32]</displayName>
            <addressOffset>0x20</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_USER1[39:32]</name>
                    <brief>OB_USER1 value bit 39 to 32</brief>
                    <description>OB_USER1 value bit 39 to 32</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1_N[39:32]</name>
            <displayName>OB_USER1_N[39:32]</displayName>
            <addressOffset>0x21</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_USER1_N[39:32]</name>
                    <brief>OB_USER1 complement value bit 39 to 32</brief>
                    <description>OB_USER1 complement value bit 39 to 32</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1[47:40]</name>
            <displayName>OB_USER1[47:40]</displayName>
            <addressOffset>0x22</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_USER1[47:40]</name>
                    <brief>OB_USER1 value bit 47 to 40</brief>
                    <description>OB_USER1 value bit 47 to 40</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1_N[47:40]</name>
            <displayName>OB_USER1_N[47:40]</displayName>
            <addressOffset>0x23</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_USER1_N[47:40]</name>
                    <brief>OB_USER1 complement value bit 47 to 40</brief>
                    <description>OB_USER1 complement value bit 47 to 40</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1[55:48]</name>
            <displayName>OB_USER1[55:48]</displayName>
            <addressOffset>0x24</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_USER1[55:48]</name>
                    <brief>OB_USER1 value bit 55 to 48</brief>
                    <description>OB_USER1 value bit 55 to 48</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1_N[55:48]</name>
            <displayName>OB_USER1_N[55:48]</displayName>
            <addressOffset>0x25</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_USER1_N[55:48]</name>
                    <brief>OB_USER1 complement value bit 55 to 48</brief>
                    <description>OB_USER1 complement value bit 55 to 48</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1[63:56]</name>
            <displayName>OB_USER1[63:56]</displayName>
            <addressOffset>0x26</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_USER1[63:56]</name>
                    <brief>OB_USER1 value bit 63 to 56</brief>
                    <description>OB_USER1 value bit 63 to 56</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1_N[63:56]</name>
            <displayName>OB_USER1_N[63:56]</displayName>
            <addressOffset>0x27</addressOffset>
            <size>0x8</size>
            <access>read</access>
