light-136/GitCC/GD32驱动器/GD32固件烧录/GD32 All In One Programmer/OptionBytesXML/GD32A71x.xml
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK0WP[7]</name>
                    <brief>0x800E000~0x800FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 7(0x800E000~0x800FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[6]</name>
                    <brief>0x800C000~0x800DFFF</brief>
                    <description>Page erase / program protection of bank0 bit 6(0x800C000~0x800DFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[5]</name>
                    <brief>0x800A000~0x800BFFF</brief>
                    <description>Page erase / program protection of bank0 bit 5(0x800A000~0x800BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[4]</name>
                    <brief>0x8008000~0x8009FFF</brief>
                    <description>Page erase / program protection of bank0 bit 4(0x8008000~0x8009FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[3]</name>
                    <brief>0x8006000~0x8007FFF</brief>
                    <description>Page erase / program protection of bank0 bit 3(0x8006000~0x8007FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[2]</name>
                    <brief>0x8004000~0x8005FFF</brief>
                    <description>Page erase / program protection of bank0 bit 2(0x8004000~0x8005FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[1]</name>
                    <brief>0x8002000~0x8003FFF</brief>
                    <description>Page erase / program protection of bank0 bit 1(0x8002000~0x8003FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[0]</name>
                    <brief>0x8000000~0x8001FFF</brief>
                    <description>Page erase / program protection of bank0 bit 0(0x8000000~0x8001FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP_N[7:0]</name>
            <displayName>OB_BK0WP_N[7:0]</displayName>
            <addressOffset>0x9</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_BK0WP_N[7:0]</name>
                    <brief>OB_BK0WP complement value bit 7 to 0</brief>
                    <description>OB_BK0WP complement value bit 7 to 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP[15:8]</name>
            <displayName>OB_BK0WP[15:8]</displayName>
            <addressOffset>0xA</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK0WP[15]</name>
                    <brief>0x801E000~0x801FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 15(0x801E000~0x801FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[14]</name>
                    <brief>0x801C000~0x801DFFF</brief>
                    <description>Page erase / program protection of bank0 bit 14(0x801C000~0x801DFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[13]</name>
                    <brief>0x801A000~0x801BFFF</brief>
                    <description>Page erase / program protection of bank0 bit 13(0x801A000~0x801BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[12]</name>
                    <brief>0x8018000~0x8019FFF</brief>
                    <description>Page erase / program protection of bank0 bit 12(0x8018000~0x8019FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[11]</name>
                    <brief>0x8016000~0x8017FFF</brief>
                    <description>Page erase / program protection of bank0 bit 11(0x8016000~0x8017FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[10]</name>
                    <brief>0x8014000~0x8015FFF</brief>
                    <description>Page erase / program protection of bank0 bit 10(0x8014000~0x8015FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[9]</name>
                    <brief>0x8012000~0x8013FFF</brief>
                    <description>Page erase / program protection of bank0 bit 9(0x8012000~0x8013FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[8]</name>
                    <brief>0x8010000~0x8011FFF</brief>
                    <description>Page erase / program protection of bank0 bit 8(0x8010000~0x8011FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP_N[15:8]</name>
            <displayName>OB_BK0WP_N[15:8]</displayName>
            <addressOffset>0xB</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_BK0WP_N[15:8]</name>
                    <brief>OB_BK0WP complement value bit 15 to 8</brief>
                    <description>OB_BK0WP complement value bit 15 to 8</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP[23:16]</name>
            <displayName>OB_BK0WP[23:16]</displayName>
            <addressOffset>0xC</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK0WP[23]</name>
                    <brief>0x802E000~0x802FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 23(0x802E000~0x802FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[22]</name>
                    <brief>0x802C000~0x802DFFF</brief>
                    <description>Page erase / program protection of bank0 bit 22(0x802C000~0x802DFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[21]</name>
                    <brief>0x802A000~0x802BFFF</brief>
                    <description>Page erase / program protection of bank0 bit 21(0x802A000~0x802BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[20]</name>
                    <brief>0x8028000~0x8029FFF</brief>
                    <description>Page erase / program protection of bank0 bit 20(0x8028000~0x8029FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[19]</name>
                    <brief>0x8026000~0x8027FFF</brief>
                    <description>Page erase / program protection of bank0 bit 19(0x8026000~0x8027FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[18]</name>
                    <brief>0x8024000~0x8025FFF</brief>
                    <description>Page erase / program protection of bank0 bit 18(0x8024000~0x8025FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[17]</name>
                    <brief>0x8024000~0x8025FFF</brief>
                    <description>Page erase / program protection of bank0 bit 17(0x8024000~0x8025FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[16]</name>
                    <brief>0x8022000~0x8023FFF</brief>
                    <description>Page erase / program protection of bank0 bit 16(0x8022000~0x8023FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP_N[23:16]</name>
            <displayName>OB_BK0WP_N[23:16]</displayName>
            <addressOffset>0xD</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_BK0WP_N[23:16]</name>
                    <brief>OB_BK0WP complement value bit 23 to 16</brief>
                    <description>OB_BK0WP complement value bit 23 to 16</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP[31:24]</name>
            <displayName>OB_BK0WP[31:24]</displayName>
            <addressOffset>0xE</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK0WP[31]</name>
                    <brief>0x803E000~0x803FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 31(0x803E000~0x803FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[30]</name>
                    <brief>0x803C000~0x803DFFF</brief>
                    <description>Page erase / program protection of bank0 bit 30(0x803C000~0x803DFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[29]</name>
                    <brief>0x803A000~0x803BFFF</brief>
                    <description>Page erase / program protection of bank0 bit 29(0x803A000~0x803BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[28]</name>
                    <brief>0x8038000~0x8039FFF</brief>
                    <description>Page erase / program protection of bank0 bit 28(0x8038000~0x8039FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[27]</name>
                    <brief>0x8036000~0x8037FFF</brief>
                    <description>Page erase / program protection of bank0 bit 27(0x8036000~0x8037FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[26]</name>
                    <brief>0x8034000~0x8035FFF</brief>
                    <description>Page erase / program protection of bank0 bit 26(0x8034000~0x8035FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[25]</name>
                    <brief>0x8032000~0x8033FFF</brief>
                    <description>Page erase / program protection of bank0 bit 25(0x8032000~0x8033FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[24]</name>
                    <brief>0x8030000~0x8031FFF</brief>
                    <description>Page erase / program protection of bank0 bit 24(0x8030000~0x8031FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP_N[31:24]</name>
            <displayName>OB_BK0WP_N[31:24]</displayName>
            <addressOffset>0xF</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_BK0WP_N[31:24]</name>
                    <brief>OB_BK0WP complement value bit 31 to 24</brief>
                    <description>OB_BK0WP complement value bit 31 to 24</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK1WP[7:0]</name>
            <displayName>OB_BK1WP[7:0]</displayName>
            <addressOffset>0x10</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK1WP[7]</name>
                    <brief>0x804E000~0x804FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 7(0x804E000~0x804FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[6]</name>
                    <brief>0x804C000~0x804DFFF</brief>
                    <description>Page erase / program protection of bank1 bit 6(0x804C000~0x804DFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[5]</name>
                    <brief>0x804A000~0x804BFFF</brief>
                    <description>Page erase / program protection of bank1 bit 5(0x804A000~0x804BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[4]</name>
                    <brief>0x8048000~0x8049FFF</brief>
                    <description>Page erase / program protection of bank1 bit 4(0x8048000~0x8049FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[3]</name>
                    <brief>0x8046000~0x8047FFF</brief>
                    <description>Page erase / program protection of bank1 bit 3(0x8046000~0x8047FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[2]</name>
                    <brief>0x8044000~0x8045FFF</brief>
                    <description>Page erase / program protection of bank1 bit 2(0x8044000~0x8045FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[1]</name>
                    <brief>0x8042000~0x8043FFF</brief>
                    <description>Page erase / program protection of bank1 bit 1(0x8042000~0x8043FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[0]</name>
                    <brief>0x8040000~0x8041FFF</brief>
                    <description>Page erase / program protection of bank1 bit 0(0x8040000~0x8041FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK1WP_N[7:0]</name>
            <displayName>OB_BK1WP_N[7:0]</displayName>
            <addressOffset>0x11</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_BK1WP_N[7:0]</name>
                    <brief>OB_BK1WP complement value bit 7 to 0</brief>
                    <description>OB_BK1WP complement value bit 7 to 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK1WP[15:8]</name>
            <displayName>OB_BK1WP[15:8]</displayName>
            <addressOffset>0x12</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK1WP[15]</name>
                    <brief>0x805E000~0x805FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 15(0x805E000~0x805FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[14]</name>
                    <brief>0x805C000~0x805DFFF</brief>
                    <description>Page erase / program protection of bank1 bit 14(0x805C000~0x805DFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[13]</name>
                    <brief>0x805A000~0x805BFFF</brief>
                    <description>Page erase / program protection of bank1 bit 13(0x805A000~0x805BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[12]</name>
                    <brief>0x8058000~0x8059FFF</brief>
                    <description>Page erase / program protection of bank1 bit 12(0x8058000~0x8059FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[11]</name>
                    <brief>0x8056000~0x8057FFF</brief>
                    <description>Page erase / program protection of bank1 bit 11(0x8056000~0x8057FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[10]</name>
                    <brief>0x8054000~0x8055FFF</brief>
                    <description>Page erase / program protection of bank1 bit 10(0x8054000~0x8055FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
