light-136/GitCC/GD32驱动器/GD32固件烧录/GD32 All In One Programmer/OptionBytesXML/GD32A71x.xml
                </field>
                <field>
                    <name>OB_BK1WP[9]</name>
                    <brief>0x8052000~0x8053FFF</brief>
                    <description>Page erase / program protection of bank1 bit 9(0x8052000~0x8053FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[8]</name>
                    <brief>0x8050000~0x8051FFF</brief>
                    <description>Page erase / program protection of bank1 bit 8(0x8050000~0x8051FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK1WP_N[15:8]</name>
            <displayName>OB_BK1WP_N[15:8]</displayName>
            <addressOffset>0x13</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_BK1WP_N[15:8]</name>
                    <brief>OB_BK1WP complement value bit 15 to 8</brief>
                    <description>OB_BK1WP complement value bit 15 to 8</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK1WP[23:16]</name>
            <displayName>OB_BK1WP[23:16]</displayName>
            <addressOffset>0x14</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK1WP[23]</name>
                    <brief>0x806E000~0x806FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 23(0x806E000~0x806FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[22]</name>
                    <brief>0x806C000~0x806DFFF</brief>
                    <description>Page erase / program protection of bank1 bit 22(0x806C000~0x806DFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[21]</name>
                    <brief>0x806A000~0x806BFFF</brief>
                    <description>Page erase / program protection of bank1 bit 21(0x806A000~0x806BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[20]</name>
                    <brief>0x8068000~0x8069FFF</brief>
                    <description>Page erase / program protection of bank1 bit 20(0x8068000~0x8069FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[19]</name>
                    <brief>0x8066000~0x8067FFF</brief>
                    <description>Page erase / program protection of bank1 bit 19(0x8066000~0x8067FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[18]</name>
                    <brief>0x8064000~0x8065FFF</brief>
                    <description>Page erase / program protection of bank1 bit 18(0x8064000~0x8065FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[17]</name>
                    <brief>0x8062000~0x8063FFF</brief>
                    <description>Page erase / program protection of bank1 bit 17(0x8062000~0x8063FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[16]</name>
                    <brief>0x8060000~0x8061FFF</brief>
                    <description>Page erase / program protection of bank1 bit 16(0x8060000~0x8061FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK1WP_N[23:16]</name>
            <displayName>OB_BK1WP_N[23:16]</displayName>
            <addressOffset>0x15</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_BK1WP_N[23:16]</name>
                    <brief>OB_BK1WP complement value bit 23 to 16</brief>
                    <description>OB_BK1WP complement value bit 23 to 16</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK1WP[31:24]</name>
            <displayName>OB_BK1WP[31:24]</displayName>
            <addressOffset>0x16</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK1WP[31]</name>
                    <brief>0x807E000~0x807FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 31(0x807E000~0x807FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[30]</name>
                    <brief>0x807C000~0x807DFFF</brief>
                    <description>Page erase / program protection of bank1 bit 30(0x807C000~0x807DFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[29]</name>
                    <brief>0x807A000~0x807BFFF</brief>
                    <description>Page erase / program protection of bank1 bit 29(0x807A000~0x807BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[28]</name>
                    <brief>0x8078000~0x8079FFF</brief>
                    <description>Page erase / program protection of bank1 bit 28(0x8078000~0x8079FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[27]</name>
                    <brief>0x8076000~0x8077FFF</brief>
                    <description>Page erase / program protection of bank1 bit 27(0x8076000~0x8077FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[26]</name>
                    <brief>0x8074000~0x8075FFF</brief>
                    <description>Page erase / program protection of bank1 bit 26(0x8074000~0x8075FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[25]</name>
                    <brief>0x8072000~0x8073FFF</brief>
                    <description>Page erase / program protection of bank1 bit 25(0x8072000~0x8073FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[24]</name>
                    <brief>0x8070000~0x8071FFF</brief>
                    <description>Page erase / program protection of bank1 bit 24(0x8070000~0x8071FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK1WP_N[31:24]</name>
            <displayName>OB_BK1WP_N[31:24]</displayName>
            <addressOffset>0x17</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_BK1WP_N[31:24]</name>
                    <brief>OB_BK1WP complement value bit 31 to 24</brief>
                    <description>OB_BK1WP complement value bit 31 to 24</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1[7:0]</name>
            <displayName>OB_USER1[7:0]</displayName>
            <addressOffset>0x18</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>value bit 7 to 0</name>
                    <brief>value bit 7 to 0</brief>
                    <description>value bit 7 to 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1_N[7:0]</name>
            <displayName>OB_USER1_N[7:0]</displayName>
            <addressOffset>0x19</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_USER1_N[7:0]</name>
                    <brief>OB_USER1 complement value bit 7 to 0</brief>
                    <description>OB_USER1 complement value bit 7 to 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1[15:8]</name>
            <displayName>OB_USER1[15:8]</displayName>
            <addressOffset>0x1A</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_USER1[15:8]</name>
                    <brief>OB_USER1 value bit 15 to 8</brief>
                    <description>OB_USER1 value bit 15 to 8</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1_N[15:8]</name>
            <displayName>OB_USER1_N[15:8]</displayName>
            <addressOffset>0x1B</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_USER1_N[15:8]</name>
                    <brief>OB_USER1 complement value bit 15 to 8</brief>
                    <description>OB_USER1 complement value bit 15 to 8</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1[23:16]</name>
            <displayName>OB_USER1[23:16]</displayName>
            <addressOffset>0x1C</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_USER1[23:16]</name>
                    <brief>OB_USER1 value bit 23 to 16</brief>
                    <description>OB_USER1 value bit 23 to 16</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1_N[23:16]</name>
            <displayName>OB_USER1_N[23:16]</displayName>
            <addressOffset>0x1D</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_USER1_N[23:16]</name>
                    <brief>OB_USER1 complement value bit 23 to 16</brief>
                    <description>OB_USER1 complement value bit 23 to 16</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1[31:24]</name>
            <displayName>OB_USER1[31:24]</displayName>
            <addressOffset>0x1E</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_USER1[31:24]</name>
                    <brief>OB_USER1 value bit 31 to 24</brief>
                    <description>OB_USER1 value bit 31 to 24</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1_N[31:24]</name>
            <displayName>OB_USER1_N[31:24]</displayName>
            <addressOffset>0x1F</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_USER1_N[31:24]</name>
                    <brief>OB_USER1 complement value bit 31 to 24</brief>
                    <description>OB_USER1 complement value bit 31 to 24</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1[39:32]</name>
            <displayName>OB_USER1[39:32]</displayName>
            <addressOffset>0x20</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_USER1[39:32]</name>
                    <brief>OB_USER1 value bit 39 to 32</brief>
                    <description>OB_USER1 value bit 39 to 32</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1_N[39:32]</name>
            <displayName>OB_USER1_N[39:32]</displayName>
            <addressOffset>0x21</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_USER1_N[39:32]</name>
                    <brief>OB_USER1 complement value bit 39 to 32</brief>
                    <description>OB_USER1 complement value bit 39 to 32</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1[47:40]</name>
            <displayName>OB_USER1[47:40]</displayName>
            <addressOffset>0x22</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_USER1[47:40]</name>
                    <brief>OB_USER1 value bit 47 to 40</brief>
                    <description>OB_USER1 value bit 47 to 40</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1_N[47:40]</name>
            <displayName>OB_USER1_N[47:40]</displayName>
            <addressOffset>0x23</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_USER1_N[47:40]</name>
                    <brief>OB_USER1 complement value bit 47 to 40</brief>
                    <description>OB_USER1 complement value bit 47 to 40</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1[55:48]</name>
            <displayName>OB_USER1[55:48]</displayName>
            <addressOffset>0x24</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_USER1[55:48]</name>
                    <brief>OB_USER1 value bit 55 to 48</brief>
                    <description>OB_USER1 value bit 55 to 48</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1_N[55:48]</name>
            <displayName>OB_USER1_N[55:48]</displayName>
            <addressOffset>0x25</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_USER1_N[55:48]</name>
                    <brief>OB_USER1 complement value bit 55 to 48</brief>
                    <description>OB_USER1 complement value bit 55 to 48</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1[63:56]</name>
            <displayName>OB_USER1[63:56]</displayName>
            <addressOffset>0x26</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_USER1[63:56]</name>
                    <brief>OB_USER1 value bit 63 to 56</brief>
                    <description>OB_USER1 value bit 63 to 56</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1_N[63:56]</name>
            <displayName>OB_USER1_N[63:56]</displayName>
            <addressOffset>0x27</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_USER1_N[63:56]</name>
                    <brief>OB_USER1 complement value bit 63 to 56</brief>
                    <description>OB_USER1 complement value bit 63 to 56</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_DFWP[7:0]</name>
            <displayName>OB_DFWP[7:0]</displayName>
            <addressOffset>0x28</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_DFWP[7]</name>
                    <brief>0x881C000~0x881FFFF</brief>
                    <description>Page erase / program protection of Data flash bit 7(0x881C000~0x881FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_DFWP[6]</name>
                    <brief>0x8818000~0x881BFFF</brief>
                    <description>Page erase / program protection of Data flash bit 6(0x8818000~0x881BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_DFWP[5]</name>
                    <brief>0x8814000~0x8817FFF</brief>
                    <description>Page erase / program protection of Data flash bit 5(0x8814000~0x8817FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_DFWP[4]</name>
                    <brief>0x8810000~0x8813FFF</brief>
                    <description>Page erase / program protection of Data flash bit 4(0x8810000~0x8813FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_DFWP[3]</name>
                    <brief>0x880C000~0x880FFFF</brief>
                    <description>Page erase / program protection of Data flash bit 3(0x880C000~0x880FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_DFWP[2]</name>
                    <brief>0x8808000~0x880BFFF</brief>
                    <description>Page erase / program protection of Data flash bit 2(0x8808000~0x880BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
