light-136/GitCC/GD32驱动器/GD32固件烧录/GD32 All In One Programmer/OptionBytesXML/GD32A71x.xml
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_DFWP[1]</name>
                    <brief>0x8804000~0x8807FFF</brief>
                    <description>Page erase / program protection of Data flash bit 1(0x8804000~0x8807FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_DFWP[0]</name>
                    <brief>0x8800000~0x8803FFF</brief>
                    <description>Page erase / program protection of Data flash bit 0(0x8800000~0x8803FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_DFWP_N[7:0]</name>
            <displayName>OB_DFWP_N[7:0]</displayName>
            <addressOffset>0x29</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_DFWP_N[7:0]</name>
                    <brief>OB_DFWP complement value bit 7 to 0</brief>
                    <description>OB_DFWP complement value bit 7 to 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_CLTCFG[7:0]</name>
            <displayName>OB_CLTCFG[7:0]</displayName>
            <addressOffset>0x2A</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFD</reset>
            <complement>FFFF</complement>
            <fields>
				<field>
                    <name>PORWDG_EN</name>
                    <brief>POR watchdog enable</brief>
					<description>POR watchdog enable&#x000A;0:POR watchdog disabled&#x000A;1:POR watchdog enabled</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
				<field>
                    <name>FFPIN_MOD</name>
                    <brief>configuration of the fatal fault pins mode</brief>
					<description>configuration of the fatal fault pins mode&#x000A;0:FFPin[0] and FFPin[1] acts as general GPIO pins&#x000A;1:FFPin[0] and FFPin[1] acts as dedicated fatal fault reaction pins</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
				<field>
                    <name>RSTPIN_MOD</name>
                    <brief>Reset pin mode</brief>
					<description>Reset pin mode&#x000A;0:Reset pin acts as general GPIO pin multiplexed with non-reset function&#x000A;1:Reset pin acts as dedicated</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_CLTCFG_N[7:0]</name>
            <displayName>OB_CLTCFG_N[7:0]</displayName>
            <addressOffset>0x2B</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x02</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_CLTCFG_N[7:0]</name>
                    <brief>OB_CLTCFG complement value bit 7 to 0</brief>
                    <description>OB_CLTCFG complement value bit 7 to 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_CLTCFG[15:8]</name>
            <displayName>OB_CLTCFG[15:8]</displayName>
            <addressOffset>0x2C</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0x00</reset>
            <complement>FFFF</complement>
            <fields>
				<field>
                    <name>RCTL_SUBSRU_UEN</name>
                    <brief>Subsystem reset upgrade upgrade enable</brief>
					<description>Subsystem reset upgrade upgrade enable&#x000A;0:RCTL_SUBSRU upgrade disable&#x000A;1:RCTL_SUBSRU system reset upgrade enable</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
				<field>
                    <name>STCM_REC_FAIL_UEN</name>
                    <brief>STCM recover failed upgrade enable</brief>
					<description>STCM recover failed upgrade enable&#x000A;0:STCM_REC_FAIL system reset upgrade disable&#x000A;1:STCM_REC_FAIL system reset upgrade enable</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
				<field>
                    <name>FMU_REA_FAIL_UEN</name>
                    <brief>FMU react failed upgrade enable</brief>
					<description>FMU react failed upgrade enable&#x000A;0:FMU_REA_FAIL system reset upgrade disable&#x000A;1:FMU_REA_FAIL system reset upgrade enable</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_CLTCFG_N[15:8]</name>
            <displayName>OB_CLTCFG_N[15:8]</displayName>
            <addressOffset>0x2D</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0xFF</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_CLTCFG_N[15:8]</name>
                    <brief>OB_CLTCFG complement value bit 15 to 8</brief>
                    <description>OB_CLTCFG complement value bit 15 to 8</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_CLTCFG[23:16]</name>
            <displayName>OB_CLTCFG[23:16]</displayName>
            <addressOffset>0x2E</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0x00</reset>
            <complement>FFFF</complement>
            <fields>
				<field>
                    <name>SYS_CK_FAIL_UEN</name>
                    <brief>System clock failed upgrade enable</brief>
					<description>System clock failed upgrade enable&#x000A;0:SYS_CK_FAIL system reset upgrade disable&#x000A;1:SYS_CK_FAIL system reset upgrade enable</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>		
				<field>
                    <name>CORE_CK_FAIL_UEN</name>
                    <brief>Core clock failed upgrade enable</brief>
					<description>Core clock failed upgrade enable&#x000A;0:CORE_CK_FAIL system reset upgrade disable&#x000A;1:CORE_CK_FAIL system reset upgrade enable</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>				
				<field>
                    <name>LOPRST_UEN</name>
                    <brief>Loss of PLL error upgrade enable</brief>
					<description>Loss of PLL error upgrade enable&#x000A;0:LOPRST system reset upgrade disable&#x000A;1:LOPRST system reset upgrade enable</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
				<field>
                    <name>LOHRST_UEN</name>
                    <brief>Loss of HXTAL error upgrade enable</brief>
					<description>Loss of HXTAL error upgrade enable&#x000A;0:LOHRST system reset upgrade disable&#x000A;1:LOHRST system reset upgrade enable</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_CLTCFG_N[23:16]</name>
            <displayName>OB_CLTCFG_N[23:16]</displayName>
            <addressOffset>0x2F</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0xFF</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_CLTCFG_N[23:16]</name>
                    <brief>OB_CLTCFG complement value bit 23 to 16</brief>
                    <description>OB_CLTCFG complement value bit 23 to 16</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_CLTCFG[31:24]</name>
            <displayName>OB_CLTCFG[31:24]</displayName>
            <addressOffset>0x30</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0x00</reset>
            <complement>FFFF</complement>
            <fields>
				<field>
                    <name>HSM_SYS_RST_UEN</name>
                    <brief>HSM system reset detection upgrade enable</brief>
					<description>HSM system reset detection upgrade enable&#x000A;0:HSM_SYS_RST system reset upgrade disable&#x000A;1:HSM_SYS_RST system reset upgrade enable</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_CLTCFG_N[31:24]</name>
            <displayName>OB_CLTCFG_N[31:24]</displayName>
            <addressOffset>0x31</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0xFF</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_CLTCFG_N[31:24]</name>
                    <brief>OB_CLTCFG complement value bit 31 to 24</brief>
                    <description>OB_CLTCFG complement value bit 31 to 24</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_CLTCFG[39:32]</name>
            <displayName>OB_CLTCFG[39:32]</displayName>
            <addressOffset>0x32</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0x00</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>DBG_SYS_RST_UEN</name>
                    <brief>Debug system reset upgrade enable</brief>
					<description>Debug system reset upgrade enable&#x000A;0:DBG_SYS_RST system reset upgrade disable&#x000A;1:DBG_SYS_RST system reset upgrade enable</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
				<field>
                    <name>SW_SYS_RST_UEN</name>
                    <brief>Software system reset upgrade enable</brief>
					<description>Software system reset upgrade enable&#x000A;0:SW_SYS_RST system reset upgrade disable&#x000A;1:SW_SYS_RST system reset upgrade enable</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_CLTCFG_N[39:32]</name>
            <displayName>OB_CLTCFG_N[39:32]</displayName>
            <addressOffset>0x33</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0xFF</reset>
            <complement>0</complement>
            <fields>
				<field>
                    <name>OB_CLTCFG_N[39:32]</name>
                    <brief>OB_CLTCFG complement value bit 39 to 32</brief>
                    <description>OB_CLTCFG complement value bit 39 to 32</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
		<OPByte>
            <name>OB_CLTCFG[47:40]</name>
            <displayName>OB_CLTCFG[47:40]</displayName>
            <addressOffset>0x34</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0x00</reset>
            <complement>FFFF</complement>
            <fields>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_CLTCFG_N[47:40]</name>
            <displayName>OB_CLTCFG_N[47:40]</displayName>
            <addressOffset>0x35</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0xFF</reset>
            <complement>0</complement>
            <fields>
				<field>
                    <name>OB_CLTCFG_N[47:40]</name>
                    <brief>OB_CLTCFG complement value bit 47 to 40</brief>
                    <description>OB_CLTCFG complement value bit 47 to 40</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
    </OPBytes>
</OPBytesArchitecture-->
<OTPBytesBlocks>
    <OTPBlocks baseAddress="0x1FFF7000" length="2048"/>
</OTPBytesBlocks>
<OTPBytes baseAddress="0x1FFF7000" length="2048">
    <OTPBlocks>
        <name>OTP</name>
		<displayName>OTP</displayName>
        <minProgrammeWidth>0x40</minProgrammeWidth>
		<maxProgrammeWidth>0x40</maxProgrammeWidth>
		<lockBaseAddress>0x0</lockBaseAddress>
		<BlockCnt>0x01</BlockCnt>
		<baseAddress>0x1FFF7000</baseAddress>
		<endAddress>0x1FFF77FF</endAddress>
        <fields>
		   <field>
                <name>OTP_Block</name>
				<displayName>OTP_Block</displayName>
                <baseAddress>0x1FFF7000</baseAddress>
		        <endAddress>0x1FFF77FF</endAddress>	
				<ifHasLockArea>0x0</ifHasLockArea>
				<size>0x800</size>
				<lockOffset>0x00</lockOffset>
				<lockbitWidth>0</lockbitWidth>
				<LockVal>0</LockVal>
            </field>
        </fields>
    </OTPBlocks>
</OTPBytes>